In [9]:
from pydataset import data
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
import thinkstats2
import thinkplot
import numpy as np

In [2]:
titanic = data('titanic')

In [22]:
titanic.head(2)

       class     age  sex  survived
1  1st class  adults  man         1
2  1st class  adults  man         1

In [4]:
#distincs in columns
print(titanic['class'].unique())
print(titanic['age'].unique())
print(titanic['sex'].unique())
print(titanic['survived'].unique())

['1st class' '2nd class' '3rd class']
['adults' 'child']
['man' 'women']
['yes' 'no']

In [24]:
#replace y/n with 1/0
titanic.survived.replace(('yes','no'), (1,0), inplace=True)

In [21]:
x = titanic['class'].value_counts(sort=True)

pandas.core.series.Series

In [11]:
l_class =  titanic['class'].unique().tolist()
l_class

['1st class', '2nd class', '3rd class']

In [28]:
c_survived_cnt = []
for i in l_class:
    x = titanic[titanic['class']==i]['survived'].count()
    c_survived_cnt.append(x)
c_survived_cnt

[325, 285, 706]

In [66]:
c_cnt = titanic.groupby(['class','survived']).size().reset_index(name='counts')
c_cnt

       class  survived  counts
0  1st class         0     122
1  1st class         1     203
2  2nd class         0     167
3  2nd class         1     118
4  3rd class         0     528
5  3rd class         1     178

In [76]:
c_cnt = c_cnt.pivot_table(values ='counts', index='class', columns = 'survived').reset_index()
c_cnt

survived      class    0    1
0         1st class  122  203
1         2nd class  167  118
2         3rd class  528  178

In [95]:
c_cnt.rename(columns= {'class':'n_class'}, inplace=True)

In [82]:
c_cnt.rename(columns= {0:'died', 1:'lived'}, inplace=True)

In [84]:
c_cnt['lived_perc'] = (c_cnt.lived/sum(c_cnt.died, c_cnt.lived))

In [98]:
c_cnt.reset_index()

survived  index    n_class  died  lived  lived_perc
0             0  1st class   122    203    0.199020
1             1  2nd class   167    118    0.126203
2             2  3rd class   528    178    0.178894

In [96]:
c_cnt.n_class

0    1st class
1    2nd class
2    3rd class
Name: n_class, dtype: object

In [93]:
c_cnt.columns

Index(['class', 'died', 'lived', 'lived_perc'], dtype='object', name='survived')

In [107]:
x = c_cnt.n_class
y=c_cnt.lived_perc.tolist()

In [108]:
plt.xticks(x, c_cnt.n_class)
titanic.plot(x= np.array([0,1,2]), y = y, kind='bar')
plt.show()

TypeError: 'list' object is not callable

In [110]:
x = np.array([0,1,2,3])

In [112]:

y = np.array([20,21,22,23])
my_xticks = ['John','Arnold','Mavis','Matt']
plt.xticks(np.array([0,1,2,3]), my_xticks)
plt.plot(x, y)
plt.show()

TypeError: 'list' object is not callable